#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cl-infrastructure/terraform-cloud-gov/runs/run-oz6pKGf2uA3Pck8F

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tfe_workspace.test will be created
  + resource "tfe_workspace" "test" {
      + agent_pool_id                 = (known after apply)
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + auto_apply_run_trigger        = false
      + auto_destroy_at               = (known after apply)
      + execution_mode                = (known after apply)
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "sample-workspace"
      + operations                    = (known after apply)
      + organization                  = "cl-infrastructure"
      + project_id                    = "prj-JLaygAbry8tJDsYr"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "app",
          + "test",
        ]
      + terraform_version             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lamberthchance1, Action: `pull_request`*